{
	"Software": [
		{
			"subTitle": "Backend Development",
			"duration_minutes": 50,
			"difficulty": "Medium",
			"declared_question_count": 12,
			"description": "",
			"questions": [
				"Describe the most complex backend system you've built or significantly contributed to. What were the key technical challenges?",
				"How do you design a RESTful API? What are the principles of good API design you follow?",
				"Explain the difference between SQL and NoSQL databases. Provide a specific example where you would choose one over the other.",
				"What is middleware in a web framework like Express or Django? Give an example of how you've used it.",
				"How would you implement user authentication and authorization? Compare session-based authentication with token-based (e.g., JWT).",
				"Describe a time you had to optimize a slow database query. What steps did you take to identify and fix the bottleneck?",
				"What is the purpose of a message queue (like RabbitMQ or Kafka) in a backend architecture?",
				"Discuss the trade-offs between monolithic and microservices architectures.",
				"How do you handle error logging and monitoring in a production environment?",
				"Explain the concept of database indexing. Why is it important for performance?",
				"How do you ensure the security of your backend services against common vulnerabilities like SQL injection or XSS?",
				"What is your approach to testing in the backend? Differentiate between unit, integration, and end-to-end tests."
			],
			"question_count": 12
		},
		{
			"subTitle": "Blockchain Development",
			"duration_minutes": 75,
			"difficulty": "Hard",
			"declared_question_count": 16,
			"description": "",
			"questions": [
				"Explain the consensus mechanisms Proof of Work (PoW) and Proof of Stake (PoS). What are their security and scalability trade-offs?",
				"Walk me through the lifecycle of a transaction on the Ethereum network, from creation to block inclusion.",
				"Describe a security vulnerability you've encountered or studied in smart contracts, such as reentrancy or an integer overflow. How would you prevent it?",
				"How do you manage state and storage in a smart contract efficiently, considering gas costs?",
				"What are ERC-20, ERC-721, and ERC-1155 token standards? When would you use each?",
				"Design a simple smart contract for a decentralized voting system. What are the key functions and state variables you would include?",
				"Explain what Oracles are in the context of blockchain and why they are necessary for many dApps.",
				"What is the difference between a layer-1 and a layer-2 scaling solution? Give an example of each.",
				"How would you architect a system for off-chain data storage that needs to interact with an on-chain smart contract?",
				"Describe the architecture of a DeFi protocol you find interesting, such as a lending platform (e.g., Aave) or a decentralized exchange (e.g., Uniswap).",
				"What tools do you use for smart contract development, testing, and deployment (e.g., Hardhat, Truffle, Foundry)?",
				"How do you handle upgradability for smart contracts? Discuss patterns like the Proxy pattern.",
				"Explain what Miner Extractable Value (MEV) is and how it can impact dApp users.",
				"What is a \"state channel\" and how can it be used to improve the scalability of a blockchain application?",
				"How do you ensure your dApp's frontend interacts reliably with the blockchain, handling things like network latency and transaction confirmations?",
				"Where do you see the future of decentralized identity and self-sovereign identity (SSI) heading?"
			],
			"question_count": 16
		},
		{
			"subTitle": "Cloud Engineering",
			"duration_minutes": 70,
			"difficulty": "Hard",
			"declared_question_count": 15,
			"description": "",
			"questions": [
				"Design a highly available, scalable, and fault-tolerant architecture on AWS or Azure for a popular e-commerce website. Justify your component choices.",
				"Explain the concept of Infrastructure as Code (IaC). What are the benefits, and what tools (e.g., Terraform, CloudFormation) have you used?",
				"What is the difference between a container (e.g., Docker) and a virtual machine? Why has containerization become so popular?",
				"Describe your experience with a container orchestration tool like Kubernetes. What are Pods, Services, and Deployments?",
				"How would you design a multi-region disaster recovery strategy for a critical application?",
				"Explain the Shared Responsibility Model in a cloud provider like AWS. Where does the provider's responsibility end and the customer's begin?",
				"You've noticed a significant and unexpected increase in your monthly cloud bill. How would you investigate the cause?",
				"Compare and contrast different cloud storage options, such as object storage (S3), block storage (EBS), and file storage (EFS).",
				"How do you implement security best practices in the cloud? Discuss IAM roles, security groups, and network ACLs.",
				"What is a VPC (Virtual Private Cloud)? Why is it fundamental for network security in the cloud?",
				"Explain the concept of a serverless architecture (e.g., AWS Lambda, Azure Functions). What are its pros and cons?",
				"How do you set up monitoring and alerting for a cloud-based application to ensure high uptime?",
				"What is a Content Delivery Network (CDN), and how does it improve application performance?",
				"Describe a situation where you had to migrate a service from an on-premise data center to the cloud. What were the biggest challenges?",
				"How do you manage secrets (API keys, database credentials) in a cloud environment securely?"
			],
			"question_count": 15
		},
		{
			"subTitle": "DevOps Engineering",
			"duration_minutes": 60,
			"difficulty": "Hard",
			"declared_question_count": 15,
			"description": "",
			"questions": [
				"Describe your ideal CI/CD pipeline. What are the key stages, and what tools would you use for each?",
				"Explain the concept of Infrastructure as Code (IaC). How does it support DevOps principles?",
				"How do you use containerization (e.g., Docker) and orchestration (e.g., Kubernetes) to improve deployment workflows?",
				"You're tasked with improving the reliability of a production system. What observability pillars (metrics, logs, traces) would you focus on implementing first?",
				"What is your strategy for managing secrets and configuration across different environments (dev, staging, prod)?",
				"A developer reports that a recent deployment has caused a critical bug in production. Walk me through your rollback strategy.",
				"Explain the difference between blue-green deployment and canary releases. When would you use one over the other?",
				"How would you automate the process of setting up a new development environment for a new team member?",
				"What are your thoughts on GitOps as a methodology for managing infrastructure and applications?",
				"How do you approach security in a DevOps pipeline (DevSecOps)? Where would you integrate security checks?",
				"Describe a time you had to troubleshoot a complex production issue that involved multiple services. How did you diagnose the root cause?",
				"What is the role of a service mesh (like Istio or Linkerd) in a microservices architecture?",
				"How do you manage infrastructure cost and optimize resource utilization in a cloud environment?",
				"Explain the concept of idempotency and why it's crucial for automation scripts.",
				"How do you foster a culture of collaboration and shared ownership between development and operations teams?"
			],
			"question_count": 15
		},
		{
			"subTitle": "Frontend Development",
			"duration_minutes": 45,
			"difficulty": "Easy",
			"declared_question_count": 9,
			"description": "",
			"questions": [
				"Can you explain the difference between null, undefined, and undeclared in JavaScript?",
				"What is the CSS box model?",
				"Describe the difference between == and === in JavaScript.",
				"What is your experience with a modern JavaScript framework like React, Vue, or Angular? Which one do you prefer and why?",
				"How do you ensure your web application is responsive and works well on different devices and screen sizes?",
				"What are semantic HTML tags, and why are they important for accessibility and SEO?",
				"Explain what a closure is in JavaScript with a simple code example.",
				"How do you optimize a website's loading performance?",
				"Tell me about a frontend project you are proud of. What was your role, and what did you learn?"
			],
			"question_count": 9
		},
		{
			"subTitle": "Full Stack Development",
			"duration_minutes": 75,
			"difficulty": "Hard",
			"declared_question_count": 16,
			"description": "",
			"questions": [
				"Design a full-stack architecture for a real-time chat application. Describe the frontend, backend, database, and communication protocol you would use.",
				"Explain the end-to-end process of a user request, from the browser to the database and back.",
				"Discuss the pros and cons of different architectural patterns, such as server-side rendering (SSR), client-side rendering (CSR), and static site generation (SSG).",
				"How would you implement secure user authentication and session management in a web application?",
				"Describe your experience with both SQL and NoSQL databases. When would you choose one over the other for a project?",
				"Walk me through building a CI/CD pipeline for a full-stack application.",
				"How do you manage state in a complex frontend application? Compare different state management libraries (e.g., Redux, MobX, Vuex).",
				"What are some strategies for optimizing the performance of a full-stack application, considering both frontend and backend?",
				"How do you approach API design for consumption by a frontend client? Discuss REST vs. GraphQL.",
				"What are WebSockets, and how are they different from traditional HTTP requests? When would you use them?",
				"Describe a complex technical problem you solved that involved both frontend and backend components.",
				"How do you handle security across the full stack, from preventing XSS on the frontend to SQL injection on the backend?",
				"How do you implement effective caching strategies (browser, CDN, server-side)?",
				"What is your process for debugging an issue that could be in the frontend, backend, or database?",
				"How do you keep up with the rapidly evolving technologies in the full-stack ecosystem?",
				"You need to build a feature that requires processing a large file uploaded by a user. How would you design this to be efficient and not block the server?"
			],
			"question_count": 16
		},
		{
			"subTitle": "Game Development",
			"duration_minutes": 60,
			"difficulty": "Medium",
			"declared_question_count": 13,
			"description": "",
			"questions": [
				"Describe the main components of a game engine like Unity or Unreal.",
				"What is the game loop? Explain its main stages.",
				"How do you handle player input across different platforms (e.g., keyboard, controller, touch screen)?",
				"Explain the difference between a vertex shader and a pixel (or fragment) shader.",
				"How would you optimize a game's performance to maintain a consistent frame rate?",
				"What is a state machine, and how would you use it to manage character animations or AI behavior?",
				"Describe a physics-based feature you've implemented, such as collision detection or character movement.",
				"How do you manage game assets (models, textures, sounds) within a project?",
				"Explain the concept of object pooling and why it's important for performance.",
				"How would you design a simple quest system for an RPG?",
				"What strategies would you use for debugging a complex gameplay bug?",
				"Tell me about a game you worked on. What was the most challenging technical problem you solved?",
				"How do you approach designing and implementing user interfaces (UI) in a game?"
			],
			"question_count": 13
		},
		{
			"subTitle": "Mobile Development",
			"duration_minutes": 45,
			"difficulty": "Medium",
			"declared_question_count": 12,
			"description": "",
			"questions": [
				"Describe the lifecycle of an Activity in Android or a ViewController in iOS.",
				"How do you handle background tasks and ensure they don't negatively impact battery life?",
				"What is your approach to managing network requests and handling offline states in a mobile app?",
				"How do you persist data locally on a mobile device? Compare different options (e.g., SharedPreferences/UserDefaults, SQLite, Realm).",
				"What is your experience with declarative UI frameworks like Jetpack Compose or SwiftUI? How do they compare to traditional UI development?",
				"How do you manage dependencies in a mobile project?",
				"Describe a time you had to optimize an app for performance. What tools and techniques did you use?",
				"What is the difference between native, hybrid, and cross-platform mobile development? What are the pros and cons of each?",
				"How do you ensure a consistent user experience across different screen sizes and device models?",
				"What is your process for publishing an app to the Google Play Store or Apple App Store?",
				"How do you implement push notifications?",
				"Tell me about a challenging UI/UX problem you solved in a mobile app you developed."
			],
			"question_count": 12
		},
		{
			"subTitle": "Security Engineering",
			"duration_minutes": 65,
			"difficulty": "Hard",
			"declared_question_count": 15,
			"description": "",
			"questions": [
				"Describe the OWASP Top 10. Pick one vulnerability and explain how you would detect and mitigate it in an application.",
				"What is the principle of least privilege, and how would you apply it when designing system access controls?",
				"Explain the difference between symmetric and asymmetric encryption. When would you use each?",
				"How would you perform a security assessment or threat model for a new web application before it goes live?",
				"Describe how a Man-in-the-Middle (MitM) attack works and what measures can prevent it.",
				"You've detected a potential data breach. What are the immediate steps you would take?",
				"What is the purpose of a Web Application Firewall (WAF)? How does it differ from a network firewall?",
				"Explain the concept of defense in depth. How would you apply it to secure a cloud environment?",
				"What are the key components of a robust identity and access management (IAM) system?",
				"How do you securely store user passwords? Describe the process of hashing and salting.",
				"What is Cross-Site Scripting (XSS), and what are the different types? How can it be prevented?",
				"Explain the security implications of using third-party libraries and how you would manage those risks.",
				"What is a zero-day vulnerability, and what is the typical response process for an organization when one is discovered?",
				"How would you set up a secure software development lifecycle (SSDLC)?",
				"Imagine you are reviewing a pull request from a developer. What are some common security red flags you would look for in the code?"
			],
			"question_count": 15
		},
		{
			"subTitle": "Software Engineering",
			"duration_minutes": 60,
			"difficulty": "Medium",
			"declared_question_count": 14,
			"description": "",
			"questions": [
				"Describe a challenging software project you worked on. What was your role, and how did you overcome the challenges?",
				"Explain the SOLID principles of object-oriented design.",
				"What is the difference between an abstract class and an interface? When would you use one over the other?",
				"Write a function to determine if a string is a palindrome.",
				"How do you approach code reviews? What do you look for when reviewing a teammate's code?",
				"Design a URL shortening service like bit.ly. What are the key components and data models?",
				"What is your experience with version control systems like Git? Describe a situation where you had to resolve a complex merge conflict.",
				"Explain the concept of recursion. What are the potential pitfalls of using it?",
				"What is the purpose of unit testing, and what makes a good unit test?",
				"Describe the trade-offs between using different data structures, such as an array versus a linked list.",
				"How do you estimate the time required to complete a software task?",
				"What is technical debt, and how do you manage it?",
				"How do you stay up-to-date with new technologies and programming languages?",
				"Tell me about a time you had a disagreement with a team member on a technical decision. How did you handle it?"
			],
			"question_count": 14
		}
	],
	"Data Science": [
		{
			"subTitle": "Business Intelligence",
			"duration_minutes": 50,
			"difficulty": "Medium",
			"declared_question_count": 12,
			"description": "",
			"questions": [
				"What is the difference between business intelligence and data analysis?",
				"Walk me through the process of creating a BI dashboard, from stakeholder requirements to final deployment.",
				"What are the key performance indicators (KPIs) you would track for an e-commerce business?",
				"Explain the concept of a data warehouse. How does it differ from a transactional database?",
				"Describe your experience with BI tools like Tableau, Power BI, or Looker.",
				"How would you handle missing or incomplete data in a dataset before building a report?",
				"What is a STAR schema, and why is it commonly used in data warehousing?",
				"Imagine a marketing manager asks you to analyze the performance of a recent campaign. What questions would you ask, and what data would you need?",
				"How do you ensure the data in your reports is accurate and trustworthy?",
				"Describe a time you used data to tell a story and influence a business decision.",
				"What is the difference between a leading and a lagging indicator? Provide an example of each.",
				"How do you balance the need for detailed data with the need for clear, simple visualizations?"
			],
			"question_count": 12
		},
		{
			"subTitle": "Computer Vision",
			"duration_minutes": 80,
			"difficulty": "Hard",
			"declared_question_count": 18,
			"description": "",
			"questions": [
				"Explain the architecture of a classic Convolutional Neural Network (CNN) like LeNet-5 or AlexNet.",
				"What is the difference between image classification, object detection, and image segmentation?",
				"Describe how backpropagation works in the context of training a CNN.",
				"What are some common data augmentation techniques used in computer vision, and why are they important?",
				"Explain the concept of transfer learning and how you would apply it to a computer vision problem with a small dataset.",
				"What is a convolutional filter (or kernel), and what role does it play in feature extraction?",
				"Describe the architecture of a Region-based CNN (R-CNN) or one of its variants (Fast R-CNN, Faster R-CNN) for object detection.",
				"How does a U-Net architecture work, and why is it effective for semantic segmentation tasks?",
				"What are Generative Adversarial Networks (GANs)? Describe a potential application in computer vision.",
				"You've trained a model that performs well on your validation set but poorly in production. What could be the reasons, and how would you investigate?",
				"Explain the purpose of pooling layers in a CNN. Compare max pooling and average pooling.",
				"How would you evaluate the performance of an object detection model? Discuss metrics like IoU, precision, and recall.",
				"What are attention mechanisms in the context of vision transformers (ViT)?",
				"Describe a project where you had to deal with a large-scale image dataset. How did you manage data loading and processing?",
				"How would you approach a problem like facial recognition? What are the key challenges and ethical considerations?",
				"What is the vanishing gradient problem, and how do architectures like ResNet help mitigate it?",
				"Explain how to use techniques like Grad-CAM to visualize and interpret the decisions of a CNN.",
				"Design a system to automatically detect and blur license plates from a stream of street-view images."
			],
			"question_count": 18
		},
		{
			"subTitle": "Data Analysis",
			"duration_minutes": 45,
			"difficulty": "Easy",
			"declared_question_count": 9,
			"description": "",
			"questions": [
				"What is the difference between qualitative and quantitative data?",
				"You are given a dataset of customer transactions. What are the first few steps you would take to explore and understand the data?",
				"Explain what a p-value is in simple terms.",
				"Write a SQL query to find the top 5 customers by total sales from a customers table and an orders table.",
				"What are some common ways to handle missing data?",
				"Describe a time you found an interesting insight in a dataset. How did you communicate it to stakeholders?",
				"What are some of your favorite data visualization libraries or tools, and why?",
				"What is the difference between correlation and causation?",
				"A product manager wants to know if a new feature is successful. What metrics would you look at to answer this question?"
			],
			"question_count": 9
		},
		{
			"subTitle": "Data Engineering",
			"duration_minutes": 70,
			"difficulty": "Hard",
			"declared_question_count": 16,
			"description": "",
			"questions": [
				"Design a data pipeline to collect user interaction data from a mobile app and make it available for analysis in a data warehouse.",
				"Explain the difference between ETL and ELT. When would you prefer one over the other?",
				"What are the challenges of working with real-time streaming data versus batch data?",
				"Describe your experience with big data technologies like Hadoop, Spark, or Flink.",
				"What is data modeling, and why is it important in data engineering? Discuss STAR vs. Snowflake schemas.",
				"How do you ensure data quality and integrity in a data pipeline?",
				"What is idempotency in the context of a data pipeline, and why is it important?",
				"Explain the concept of data partitioning and how it can improve query performance in a distributed system.",
				"Compare different data storage formats like Parquet, Avro, and ORC. What are their pros and cons?",
				"How would you design a system to handle a \"late-arriving\" fact in a streaming data pipeline?",
				"What is your experience with workflow orchestration tools like Airflow or Prefect?",
				"You have a data pipeline that is running slower than expected. How would you go about identifying and resolving the bottleneck?",
				"What are the key differences between a data lake and a data warehouse?",
				"How do you manage schema evolution in a data pipeline without breaking downstream consumers?",
				"What are your strategies for monitoring, logging, and alerting for data pipelines in production?",
				"Discuss the trade-offs between different data processing engines (e.g., Spark vs. Flink) for a specific use case, like real-time fraud detection."
			],
			"question_count": 16
		},
		{
			"subTitle": "Data Science",
			"duration_minutes": 60,
			"difficulty": "Medium",
			"declared_question_count": 14,
			"description": "",
			"questions": [
				"Walk me through a data science project you have completed, from problem definition to model deployment.",
				"Explain the bias-variance trade-off. How does it relate to overfitting and underfitting?",
				"What are some different ways to evaluate the performance of a classification model?",
				"Describe the difference between supervised, unsupervised, and reinforcement learning.",
				"How would you handle a dataset with a severe class imbalance?",
				"What is feature engineering? Provide some examples of feature engineering techniques you've used.",
				"Explain the difference between a random forest and a gradient boosting model.",
				"You are tasked with building a model to predict customer churn. What features would you consider, and what model would you start with?",
				"What is cross-validation, and why is it important?",
				"How would you explain a p-value to a non-technical stakeholder?",
				"Describe a situation where you had to work with messy or incomplete data. How did you clean and prepare it for modeling?",
				"How do you choose the right machine learning algorithm for a particular problem?",
				"What is the purpose of regularization in linear models (e.g., L1 and L2 regularization)?",
				"Tell me about a time when a model you built did not perform as expected. What did you do?"
			],
			"question_count": 14
		},
		{
			"subTitle": "Data Visualization",
			"duration_minutes": 50,
			"difficulty": "Medium",
			"declared_question_count": 12,
			"description": "",
			"questions": [
				"What are the key principles of effective data visualization?",
				"When would you use a bar chart versus a line chart? What about a scatter plot versus a histogram?",
				"Tell me about a time you created a visualization that led to a specific business insight or action.",
				"How do you choose colors for your visualizations to ensure they are clear and accessible?",
				"What is your process for designing a dashboard for a business stakeholder?",
				"What is the difference between exploratory and explanatory data visualization?",
				"How do you avoid creating misleading visualizations?",
				"Describe your experience with interactive visualization libraries like D3.js or tools like Tableau.",
				"You need to visualize the distribution of a single continuous variable. What chart types would you consider?",
				"How would you visualize relationships between three different variables in a single chart?",
				"What is \"chart junk,\" and how do you minimize it?",
				"A stakeholder asks for a pie chart with 20 slices. How would you respond, and what alternative visualization might you suggest?"
			],
			"question_count": 12
		},
		{
			"subTitle": "Machine Learning",
			"duration_minutes": 75,
			"difficulty": "Hard",
			"declared_question_count": 16,
			"description": "",
			"questions": [
				"Explain the mathematical intuition behind the Support Vector Machine (SVM) algorithm. What is the role of the kernel trick?",
				"Describe the architecture and key components of a Transformer model. Why has it been so successful in NLP and beyond?",
				"What is the difference between bagging and boosting? Provide an example algorithm for each.",
				"You are building a recommendation system. Compare and contrast collaborative filtering and content-based filtering.",
				"Explain the concept of backpropagation, and walk through the chain rule as it applies to updating weights in a neural network.",
				"How do you handle the exploration-exploitation trade-off in reinforcement learning?",
				"Describe a method for dimensionality reduction, such as PCA or t-SNE. What are their underlying assumptions?",
				"You have trained a model that has high accuracy, but you suspect it is not fair to all user groups. How would you audit the model for bias and mitigate it?",
				"What are some common activation functions (e.g., Sigmoid, ReLU, Tanh) used in neural networks? What are their pros and cons?",
				"Explain the difference between Maximum Likelihood Estimation (MLE) and Maximum a Posteriori (MAP) estimation.",
				"How would you design an A/B testing framework to evaluate a new machine learning model before deploying it to all users?",
				"What are Generative Adversarial Networks (GANs)? Describe the roles of the generator and the discriminator.",
				"You need to deploy a large deep learning model to a device with limited computational resources. What model optimization techniques would you consider?",
				"What is the difference between online learning and offline (batch) learning?",
				"How do you deal with concept drift, where the statistical properties of the target variable change over time?",
				"Design a system for real-time fraud detection for credit card transactions. What models and infrastructure would you use?"
			],
			"question_count": 16
		},
		{
			"subTitle": "Natural Language Processing",
			"duration_minutes": 75,
			"difficulty": "Hard",
			"declared_question_count": 16,
			"description": "",
			"questions": [
				"Explain the evolution of word embeddings, from Word2Vec and GloVe to contextual embeddings from models like BERT.",
				"Describe the architecture of a Transformer model. What is the role of the self-attention mechanism?",
				"What is the difference between text classification, named entity recognition (NER), and sentiment analysis?",
				"You need to build a chatbot. What are the key components and challenges in designing a conversational AI system?",
				"Explain the concept of fine-tuning a large language model (LLM) for a specific downstream task.",
				"What are some techniques for handling out-of-vocabulary words in NLP models?",
				"Describe how a sequence-to-sequence (seq2seq) model with attention works, for a task like machine translation.",
				"How would you evaluate the performance of a text generation model?",
				"What is Topic Modeling? Explain an algorithm like Latent Dirichlet Allocation (LDA).",
				"How do you preprocess text data before feeding it into a machine learning model? Discuss tokenization, stemming, and lemmatization.",
				"What are the ethical challenges associated with large language models, such as bias and potential for misuse?",
				"Explain the difference between extractive and abstractive text summarization.",
				"How does Bidirectional Encoder Representations from Transformers (BERT) differ from a traditional recurrent neural network (RNN)?",
				"You are tasked with building a system to detect toxic comments online. What would your approach be?",
				"What are Retrieval-Augmented Generation (RAG) models, and how do they address some of the limitations of standard LLMs?",
				"Design a system to perform sentiment analysis on a stream of tweets about your company's product."
			],
			"question_count": 16
		}
	],
	"Design": [
		{
			"subTitle": "Design Systems",
			"duration_minutes": 70,
			"difficulty": "Hard",
			"declared_question_count": 16,
			"description": "",
			"questions": [
				"What is the purpose of a design system, and what value does it bring to an organization?",
				"Walk me through the process of creating a new component for a design system, from research to release.",
				"How do you decide what should and should not be included in a design system?",
				"What are design tokens? How do they help bridge the gap between design and engineering?",
				"How do you ensure adoption and contribution to the design system from product teams?",
				"Describe your process for versioning and communicating updates to a design system.",
				"How would you structure the documentation for a design system to make it easy for designers and developers to use?",
				"What is the difference between a component library and a true design system?",
				"How do you handle requests for one-off components or variations that don't fit the system's principles?",
				"How do you measure the success and impact of a design system?",
				"What are some of the biggest challenges you've faced when working on or implementing a design system?",
				"How do you ensure the accessibility of components within the design system?",
				"Discuss the relationship between a design system and a brand's visual identity.",
				"How would you approach building a design system for a product that needs to support multiple themes (e.g., light and dark mode, or different brands)?",
				"Tell me about a time you had to advocate for the importance of a design system to stakeholders.",
				"How do you balance the need for consistency (from the system) with the need for innovation (from product teams)?"
			],
			"question_count": 16
		},
		{
			"subTitle": "Graphic Design",
			"duration_minutes": 50,
			"difficulty": "Easy",
			"declared_question_count": 9,
			"description": "",
			"questions": [
				"Walk me through a project in your portfolio that you're most proud of. What was the goal, and what was your creative process?",
				"What are the fundamental principles of design (e.g., contrast, repetition, alignment, proximity)?",
				"How do you interpret a creative brief and translate it into a visual concept?",
				"What is the difference between raster and vector graphics? When would you use each?",
				"How do you use typography to create hierarchy and convey a specific tone?",
				"Tell me about your experience with design software like Adobe Photoshop, Illustrator, and InDesign.",
				"How do you receive and incorporate feedback on your designs?",
				"How do you stay inspired and keep up with current design trends?",
				"You are given a logo to design for a new coffee shop. What are the first steps you would take?"
			],
			"question_count": 9
		},
		{
			"subTitle": "Motion Graphics",
			"duration_minutes": 60,
			"difficulty": "Medium",
			"declared_question_count": 14,
			"description": "",
			"questions": [
				"Walk me through your motion graphics workflow, from storyboard to final render.",
				"What are the 12 principles of animation, and how do you apply them to your work?",
				"Describe a project where you had to convey a complex idea using motion graphics.",
				"What is your experience with software like After Effects, Cinema 4D, or Premiere Pro?",
				"How do you choose music and sound effects to complement your animations?",
				"Explain the concept of easing and how it affects the feel of a motion.",
				"How do you optimize your projects for efficient rendering?",
				"Tell me about a time you had to work with a tight deadline. How did you manage your time and workflow?",
				"How do you integrate motion graphics with live-action video?",
				"What is a keyframe? How do you use them to create animation?",
				"How do you ensure your motion graphics align with a brand's identity?",
				"What is your process for storyboarding a concept before starting animation?",
				"Describe a technical challenge you faced on a motion graphics project and how you solved it.",
				"Where do you find inspiration for your motion design work?"
			],
			"question_count": 14
		},
		{
			"subTitle": "Product Design",
			"duration_minutes": 75,
			"difficulty": "Hard",
			"declared_question_count": 16,
			"description": "",
			"questions": [
				"Walk me through your end-to-end design process for a new feature, from initial concept to post-launch iteration.",
				"Describe a time you used user research to make a significant change to a product's design.",
				"How do you balance user needs, business goals, and technical constraints in your design work?",
				"Tell me about a project that failed or didn't meet its goals. What did you learn from the experience?",
				"How do you collaborate with product managers and engineers throughout the design process?",
				"You've been asked to redesign the user onboarding experience for a complex SaaS product. What would be your approach?",
				"How do you use data and analytics to inform your design decisions?",
				"What is your process for creating and testing prototypes? What tools do you use?",
				"How do you approach designing for accessibility?",
				"Describe a situation where you had to defend a design decision to stakeholders who disagreed with you.",
				"How do you define and measure the success of a product's design?",
				"What is the role of a design system in your workflow as a product designer?",
				"Tell me about a time you had to make a design trade-off due to a technical limitation.",
				"How do you stay focused on the user's core problem when designing a solution?",
				"How do you decide which features to prioritize in a product roadmap from a design perspective?",
				"Critique a product you use regularly. What are its design strengths and weaknesses, and how would you improve it?"
			],
			"question_count": 16
		},
		{
			"subTitle": "UI Design",
			"duration_minutes": 45,
			"difficulty": "Easy",
			"declared_question_count": 9,
			"description": "",
			"questions": [
				"What is the difference between UI and UX design?",
				"Walk me through a UI design project from your portfolio.",
				"What are the key principles of good visual hierarchy?",
				"How do you create a consistent visual style across multiple screens of an application?",
				"What is your experience with design tools like Figma, Sketch, or Adobe XD?",
				"How do you design for different states of a UI component (e.g., default, hover, disabled, active)?",
				"What is a grid system, and why is it important in UI design?",
				"How do you choose typography and color palettes for a new project?",
				"You are asked to design a login screen. What are the essential UI elements you would include?"
			],
			"question_count": 9
		},
		{
			"subTitle": "UX Design",
			"duration_minutes": 60,
			"difficulty": "Medium",
			"declared_question_count": 14,
			"description": "",
			"questions": [
				"What is your definition of user experience design?",
				"Walk me through your UX design process for a typical project.",
				"What user research methods do you find most valuable, and why?",
				"How do you create user personas and journey maps? What purpose do they serve?",
				"Tell me about a time you had to advocate for the user when business goals were in conflict.",
				"What is the difference between information architecture and interaction design?",
				"How do you conduct usability testing? What do you look for during a session?",
				"Describe a situation where user feedback led to a major change in your design.",
				"How do you collaborate with UI designers, product managers, and developers?",
				"What is accessibility in UX, and how do you incorporate it into your work?",
				"How do you use wireframes and prototypes in your design process?",
				"What are heuristics, and how can they be used to evaluate a user interface?",
				"How do you decide what to test in a usability study?",
				"You've discovered a major usability issue in a product that is already live. What are your next steps?"
			],
			"question_count": 14
		}
	],
	"Finance": [
		{
			"subTitle": "Corporate Finance",
			"duration_minutes": 45,
			"difficulty": "Medium",
			"declared_question_count": 12,
			"description": "",
			"questions": [
				"Walk me through the three main financial statements. How are they connected?",
				"What is Working Capital, and why is it important for a company's financial health?",
				"How would you build a financial model to forecast a company's revenue for the next three years?",
				"Explain the difference between CAPEX (Capital Expenditure) and OPEX (Operating Expenditure).",
				"What is Discounted Cash Flow (DCF) analysis? What are the key assumptions you need to make?",
				"How do you calculate Free Cash Flow to the Firm (FCFF) and Free Cash Flow to Equity (FCFE)?",
				"A company's depreciation expense increases by $10 million. Walk me through the impact on the three financial statements.",
				"What are some common valuation multiples, and when would you use them?",
				"How would you analyze a company's debt structure and its ability to service that debt?",
				"What is the purpose of a variance analysis in a corporate finance role?",
				"How do you assess the viability of a new investment project? (e.g., NPV, IRR).",
				"Describe a time you had to present complex financial information to a non-financial audience."
			],
			"question_count": 12
		},
		{
			"subTitle": "Financial Planning",
			"duration_minutes": 45,
			"difficulty": "Easy",
			"declared_question_count": 9,
			"description": "",
			"questions": [
				"What are the key components of a comprehensive personal financial plan?",
				"How would you help a client define their short-term and long-term financial goals?",
				"Explain the concept of asset allocation and why it's important for an investment portfolio.",
				"What is the difference between a Roth IRA and a Traditional IRA?",
				"How do you assess a client's risk tolerance?",
				"What are the basic types of insurance (life, health, disability) you would discuss with a young family?",
				"A client wants to save for both retirement and a down payment on a house. How would you advise them to prioritize?",
				"What is an emergency fund, and how much should someone typically have saved in one?",
				"How do you stay up-to-date with changes in tax laws and financial regulations that affect your clients?"
			],
			"question_count": 9
		},
		{
			"subTitle": "Investment Banking",
			"duration_minutes": 60,
			"difficulty": "Hard",
			"declared_question_count": 15,
			"description": "",
			"questions": [
				"Walk me through a Discounted Cash Flow (DCF) analysis from start to finish.",
				"What are the most common ways to value a company? Discuss the pros and cons of each.",
				"A company acquires another company. Walk me through how this would affect the three financial statements.",
				"What is a Leveraged Buyout (LBO), and what makes a company an attractive LBO candidate?",
				"How does a $10 increase in depreciation affect the financial statements, assuming a 20% tax rate?",
				"What is accretion/dilution analysis, and why is it important in an M&A deal?",
				"How do you calculate the Weighted Average Cost of Capital (WACC)?",
				"What is the difference between Enterprise Value and Equity Value?",
				"Why might two companies with similar growth and profitability have different valuation multiples?",
				"What are some of the key terms you would find in a merger agreement?",
				"Tell me about a recent M&A deal you've followed. Do you think it was a good deal? Why or why not?",
				"What is the purpose of a sell-side M&A process, and what are the key stages?",
				"If you had to choose two of the three financial statements to analyze a company, which two would you choose and why?",
				"What are the current trends in the M&A market?"
			],
			"question_count": 14
		},
		{
			"subTitle": "Quantitative Finance",
			"duration_minutes": 80,
			"difficulty": "Hard",
			"declared_question_count": 18,
			"description": "",
			"questions": [
				"What are the assumptions of the Black-Scholes-Merton model for option pricing? How realistic are they?",
				"Explain the difference between a stationary and a non-stationary time series. How would you test for stationarity?",
				"What is stochastic calculus, and how is it used in finance? Explain Ito's Lemma.",
				"Describe the concept of Value at Risk (VaR). What are its limitations, and what are some alternative risk measures?",
				"How would you build a model to predict stock price volatility?",
				"Explain the difference between risk-neutral pricing and physical pricing.",
				"What is a Monte Carlo simulation? Walk me through how you would use it to price a complex derivative.",
				"Derive the formula for the price of a zero-coupon bond.",
				"What is the Capital Asset Pricing Model (CAPM)? What are its main criticisms?",
				"Explain the concept of a martingale. Why is it important in quantitative finance?",
				"How do you hedge the Greeks (Delta, Gamma, Vega, Theta) of an options portfolio?",
				"Describe a statistical arbitrage strategy. What are the risks involved?",
				"What is the difference between a forward contract and a futures contract?",
				"How would you use Principal Component Analysis (PCA) in a financial context?",
				"Explain how a Kalman filter works and how it could be applied to trading.",
				"What is GARCH? How is it used to model volatility clustering?",
				"How do you handle multicollinearity in a regression model?",
				"You are given two correlated time series. How would you test if they are cointegrated, and how would you build a pairs trading strategy based on this?"
			],
			"question_count": 18
		},
		{
			"subTitle": "Risk Management",
			"duration_minutes": 50,
			"difficulty": "Hard",
			"declared_question_count": 15,
			"description": "",
			"questions": [
				"What are the main types of financial risk that a bank faces? (e.g., market, credit, operational, liquidity).",
				"Explain Value at Risk (VaR). What are the different methods for calculating it, and what are its main limitations?",
				"What is the difference between risk appetite and risk tolerance?",
				"How would you assess the credit risk of a corporate borrower?",
				"Describe the purpose and function of a stress test for a financial portfolio.",
				"What is operational risk? Provide some examples and explain how it can be mitigated.",
				"Explain the concept of counterparty risk.",
				"How does a credit default swap (CDS) work?",
				"What is the role of a risk management function within a large organization?",
				"What are the Basel Accords (I, II, III), and what is their primary objective?",
				"How do you measure and manage liquidity risk?",
				"You notice a portfolio is becoming highly concentrated in a single sector. What risks does this pose, and what actions might you recommend?",
				"What is the difference between systematic and unsystematic risk?",
				"How can a company use derivatives to hedge its exposure to foreign exchange risk?",
				"Describe a time you had to identify a significant risk and communicate it to senior management."
			],
			"question_count": 15
		},
		{
			"subTitle": "Treasury Management",
			"duration_minutes": 55,
			"difficulty": "Medium",
			"declared_question_count": 13,
			"description": "",
			"questions": [
				"What is the primary role of a corporate treasury department?",
				"How would you create a daily cash forecast for a multinational company?",
				"What is a cash pooling arrangement, and what are its benefits?",
				"Explain the difference between physical and notional cash pooling.",
				"How do you manage a company's exposure to interest rate risk?",
				"What strategies would you use to optimize a company's working capital?",
				"What is a letter of credit, and when is it used?",
				"Describe the different types of foreign exchange (FX) risk a company faces.",
				"How would you develop an investment policy for a company's short-term cash reserves?",
				"What is the role of a treasury management system (TMS)?",
				"How do you maintain relationships with banking partners?",
				"A business unit needs funding for a new project. What factors would you consider before providing it?",
				"How would you respond to a sudden, unexpected cash shortfall?"
			],
			"question_count": 13
		}
	],
	"Legal": [
		{
			"subTitle": "Corporate Law",
			"duration_minutes": 60,
			"difficulty": "Hard",
			"declared_question_count": 15,
			"description": "",
			"questions": [
				"What is the business judgment rule, and how does it protect corporate directors?",
				"Explain the concept of piercing the corporate veil. Under what circumstances might a court do this?",
				"Describe the fiduciary duties of a corporate director. (Duty of Care and Duty of Loyalty).",
				"Walk me through the key stages of a private company M&A transaction from a legal perspective.",
				"What is the difference between a stock purchase and an asset purchase? What are the legal implications of each?",
				"What is a representations and warranties section in a purchase agreement, and why is it so heavily negotiated?",
				"What are the key legal considerations when advising a startup on its initial financing round?",
				"Explain the difference between common stock and preferred stock.",
				"What are the primary responsibilities of a public company's general counsel regarding SEC compliance?",
				"What is a poison pill, and how is it used as an anti-takeover defense?",
				"Describe the legal requirements for a valid board of directors meeting.",
				"What is shareholder activism, and how might a company legally respond to it?",
				"What are the key differences between a C-corporation and an S-corporation from a legal and tax perspective?",
				"What is indemnification in the context of corporate bylaws, and why is it important for directors and officers?",
				"A client wants to form a joint venture with another company. What legal structure would you recommend, and what are the key terms to include in the joint venture agreement?"
			],
			"question_count": 15
		},
		{
			"subTitle": "Criminal Law",
			"duration_minutes": 60,
			"difficulty": "Hard",
			"declared_question_count": 15,
			"description": "",
			"questions": [
				"What are the two essential elements of a crime? Explain mens rea and actus reus.",
				"Explain the difference between a specific intent and a general intent crime.",
				"What are the four levels of mens rea as defined by the Model Penal Code?",
				"A defendant is charged with murder. What are some potential affirmative defenses they could raise?",
				"What is the felony murder rule?",
				"Explain the concept of the exclusionary rule and the \"fruit of the poisonous tree\" doctrine.",
				"What are the requirements for a valid search warrant under the Fourth Amendment?",
				"Describe the circumstances under which a police officer can conduct a warrantless search.",
				"What are the Miranda rights, and when must they be given?",
				"What is a plea bargain, and what is the role of the prosecutor and defense attorney in this process?",
				"Explain the difference between direct evidence and circumstantial evidence.",
				"What must a prosecutor prove to convict a defendant of conspiracy?",
				"Describe the stages of a criminal trial, from jury selection to sentencing.",
				"What is the standard of proof in a criminal case, and how does it differ from a civil case?",
				"A client has been arrested and is being interrogated. What is the most important piece of legal advice you would give them immediately?"
			],
			"question_count": 15
		},
		{
			"subTitle": "Employment Law",
			"duration_minutes": 50,
			"difficulty": "Medium",
			"declared_question_count": 12,
			"description": "",
			"questions": [
				"What is the concept of \"at-will\" employment? What are the major exceptions to this doctrine?",
				"Explain the difference between an employee and an independent contractor. Why is this distinction important?",
				"A manager wants to fire an employee for poor performance. What legal advice would you give the manager to minimize the risk of a wrongful termination lawsuit?",
				"What are the main federal laws that prohibit discrimination in the workplace? (e.g., Title VII, ADEA, ADA).",
				"What constitutes a hostile work environment under the law?",
				"An employee requests a reasonable accommodation for a disability. What is the employer's legal obligation?",
				"What are the key provisions of the Family and Medical Leave Act (FMLA)?",
				"Explain the difference between exempt and non-exempt employees under the Fair Labor Standards Act (FLSA).",
				"What are the essential elements of an enforceable non-compete agreement?",
				"An employee has brought a complaint of harassment against their supervisor. Walk me through the steps you would take to conduct an internal investigation.",
				"What is the role of the Equal Employment Opportunity Commission (EEOC)?",
				"What legal issues should a company consider when drafting an employee handbook?"
			],
			"question_count": 12
		},
		{
			"duration_minutes": 50,
			"difficulty": "Medium",
			"declared_question_count": 12,
			"description": "",
			"questions": [
				"What are the four main types of intellectual property? Briefly describe each.",
				"What are the three requirements for an invention to be patentable?",
				"Explain the difference between a trademark and a copyright.",
				"What is the \"fair use\" doctrine in copyright law? What factors do courts consider?",
				"A client wants to protect their company's brand name. What is the process for registering a federal trademark?",
				"What constitutes trademark infringement?",
				"What is a trade secret, and what steps must a company take to protect it?",
				"Explain the difference between a utility patent and a design patent.",
				"What is the purpose of a cease and desist letter in an IP dispute?",
				"What is the Digital Millennium Copyright Act (DMCA), particularly its \"safe harbor\" provisions?",
				"A software company wants to know if they can patent their new algorithm. How would you advise them?",
				"What is the role of the World Intellectual Property Organization (WIPO)?"
			],
			"question_count": 12,
			"subTitle": "Intellectual Property"
		},
		{
			"duration_minutes": 55,
			"difficulty": "Hard",
			"declared_question_count": 15,
			"description": "",
			"questions": [
				"Walk me through the lifecycle of a civil lawsuit, from the initial client meeting to the final judgment.",
				"What is the standard for granting a motion to dismiss for failure to state a claim?",
				"Explain the different tools of discovery (interrogatories, requests for production, depositions, requests for admission).",
				"What is the attorney-client privilege? What are some exceptions to it?",
				"How would you prepare a key witness for a deposition?",
				"What is a motion for summary judgment, and what is the legal standard for granting it?",
				"Describe the process of voir dire and the different types of challenges to potential jurors.",
				"How do you decide what questions to ask a witness on direct examination versus cross-examination?",
				"What are the rules of evidence regarding hearsay? What are some common exceptions?",
				"You receive a discovery request from opposing counsel that you believe is overly broad and unduly burdensome. What are your options?",
				"What is the difference between a preliminary injunction and a temporary restraining order?",
				"What strategic considerations go into deciding whether to settle a case or take it to trial?",
				"How do you draft a compelling opening statement? What about a closing argument?",
				"What is the work product doctrine, and how does it differ from attorney-client privilege?",
				"You've just received an unfavorable ruling from the judge on a key evidentiary issue mid-trial. What do you do?"
			],
			"question_count": 15,
			"subTitle": "Litigation"
		},
		{
			"duration_minutes": 55,
			"difficulty": "Medium",
			"declared_question_count": 13,
			"description": "",
			"questions": [
				"What are the key stages of a commercial real estate transaction?",
				"What is a title search, and why is it crucial in a real estate purchase? What is title insurance?",
				"Explain the difference between a general warranty deed, a special warranty deed, and a quitclaim deed.",
				"What is a Phase I Environmental Site Assessment?",
				"Describe the key provisions you would expect to find in a commercial lease agreement.",
				"What is the difference between a gross lease, a net lease, and a triple net (NNN) lease?",
				"What is zoning, and how can a property owner seek a variance or a rezoning?",
				"Explain the concept of eminent domain.",
				"What is a 1031 exchange, and what are its benefits?",
				"What are the legal remedies for a breach of a real estate purchase agreement?",
				"What is a mechanic's lien?",
				"Describe the foreclosure process.",
				"What is the role of an estoppel certificate in a commercial real estate transaction?"
			],
			"question_count": 13,
			"subTitle": "Real Estate Law"
		}
	],
	"Media": [
		{
			"duration_minutes": 50,
			"difficulty": "Medium",
			"declared_question_count": 12,
			"description": "",
			"questions": [
				"Walk me through your process for producing a piece of content, from ideation to distribution.",
				"How do you adapt a core content idea for different platforms (e.g., a blog post becomes a video, a podcast, and social media snippets)?",
				"What tools do you use for project management and collaboration in a content production workflow?",
				"Tell me about a time a production project went off track. How did you get it back on course?",
				"How do you balance creative quality with budget and timeline constraints?",
				"What is a creative brief, and what key information must it contain to be effective?",
				"How do you source and manage freelance talent like writers, videographers, or designers?",
				"What metrics do you use to measure the success of the content you produce?",
				"How do you ensure a consistent brand voice and visual style across all content?",
				"Describe your experience with video production, including pre-production, shooting, and post-production.",
				"How do you stay organized when managing multiple content projects at once?",
				"What's a piece of content you've produced that you're particularly proud of, and why?"
			],
			"question_count": 12,
			"subTitle": "Content Production"
		},
		{
			"duration_minutes": 45,
			"difficulty": "Easy",
			"declared_question_count": 9,
			"description": "",
			"questions": [
				"What are the key components of a digital marketing strategy?",
				"Explain the difference between SEO and SEM.",
				"What is a marketing funnel (e.g., AIDA model)?",
				"What social media platform would you recommend for a B2B software company, and why?",
				"What is a call-to-action (CTA), and what makes one effective?",
				"How would you use email marketing to nurture leads?",
				"What is A/B testing, and why is it important in digital marketing?",
				"What does the metric \"conversion rate\" mean, and how would you try to improve it on a landing page?",
				"Tell me about a digital marketing campaign you admire. What made it successful?"
			],
			"question_count": 9,
			"subTitle": "Digital Marketing"
		},
		{
			"duration_minutes": 45,
			"difficulty": "Easy",
			"declared_question_count": 9,
			"description": "",
			"questions": [
				"Walk me through the steps of producing a podcast episode, from planning to publishing.",
				"What equipment do you consider essential for recording a high-quality podcast?",
				"How do you prepare for an interview with a podcast guest?",
				"What software do you use for audio recording and editing?",
				"How do you remove background noise and improve the audio quality of a recording?",
				"What is the role of show notes, and what should they include?",
				"How would you promote a new podcast to find its first listeners?",
				"What makes a compelling podcast intro?",
				"Tell me about a podcast you enjoy. What do you think makes it so good?"
			],
			"question_count": 9,
			"subTitle": "Podcast Production"
		},
		{
			"duration_minutes": 45,
			"difficulty": "Medium",
			"declared_question_count": 12,
			"description": "",
			"questions": [
				"What is the difference between public relations and advertising?",
				"How do you build and maintain relationships with journalists and media outlets?",
				"Walk me through the process of writing and distributing a press release.",
				"A negative story about our company is about to break. What are the first steps you would take?",
				"How do you identify the right media targets for a particular story or announcement?",
				"What makes a story newsworthy?",
				"How do you measure the success of a PR campaign?",
				"What is a media kit, and what should it include?",
				"How do you prepare a company executive for a media interview?",
				"Tell me about a time you successfully pitched a story that resulted in media coverage.",
				"What is the role of social media in modern public relations?",
				"How do you handle a situation where a journalist prints inaccurate information?"
			],
			"question_count": 12,
			"subTitle": "Public Relations"
		},
		{
			"duration_minutes": 40,
			"difficulty": "Easy",
			"declared_question_count": 8,
			"description": "",
			"questions": [
				"Which social media platforms are you most experienced with?",
				"How do you develop a content calendar for a brand's social media channels?",
				"What's the difference in tone and content you would use for LinkedIn versus TikTok?",
				"A customer posts a negative comment on the company's Facebook page. How do you respond?",
				"What are some key metrics you would track to measure the success of your social media efforts?",
				"How do you engage with a brand's online community and encourage conversation?",
				"How do you stay up-to-date with the latest social media trends and algorithm changes?",
				"What's a brand you think does an excellent job on social media, and why?"
			],
			"question_count": 8,
			"subTitle": "Social Media Management"
		},
		{
			"duration_minutes": 60,
			"difficulty": "Medium",
			"declared_question_count": 14,
			"description": "",
			"questions": [
				"Walk me through the three stages of video production: pre-production, production, and post-production. What happens in each stage?",
				"What is a storyboard, and why is it important?",
				"How do you create a shot list?",
				"Explain the rule of thirds in video composition.",
				"What is the difference between A-roll and B-roll footage?",
				"Describe a standard three-point lighting setup.",
				"What are some common microphones used in video production, and when would you use each?",
				"What is your experience with video editing software like Adobe Premiere Pro or Final Cut Pro?",
				"How do you select appropriate music and sound effects for a video?",
				"Explain the concept of color grading and its importance in post-production.",
				"How do you optimize video for different platforms (e.g., YouTube, Instagram Reels, LinkedIn)?",
				"Tell me about a time you had to solve a problem on set during a shoot.",
				"How do you manage large video files and keep your projects organized?",
				"Describe a video project you produced. What was the goal, and how did you achieve it?"
			],
			"question_count": 14,
			"subTitle": "Video Production"
		}
	],
	"Engineering": [
		{
			"duration_minutes": 75,
			"difficulty": "Hard",
			"declared_question_count": 16,
			"description": "",
			"questions": [
				"Explain the four fundamental forces of flight.",
				"What is the difference between lift-induced drag and parasite drag? How do they vary with airspeed?",
				"Describe the function of a winglet on an aircraft.",
				"Walk me through the basic thermodynamic cycle of a jet engine (Brayton cycle).",
				"What is the significance of the Reynolds number in aerodynamics?",
				"Explain the concept of an airfoil's center of pressure and aerodynamic center. Why is the distinction important for stability?",
				"What is orbital mechanics? Explain Kepler's laws of planetary motion.",
				"How would you calculate the delta-v required for a spacecraft to travel from a low Earth orbit to a geostationary orbit?",
				"What are some of the key challenges in designing a hypersonic vehicle?",
				"Explain the concept of aircraft stability (static and dynamic).",
				"What materials are commonly used in modern aircraft construction, and why are composites like carbon fiber becoming more prevalent?",
				"What is the purpose of a finite element analysis (FEA) in structural design?",
				"Describe the basic principles of a satellite's attitude control system.",
				"What are the key subsystems of a typical satellite?",
				"Explain the concept of Mach number and the sound barrier.",
				"You are on a team designing a new commercial airliner. What are the primary trade-offs you would need to consider between performance, cost, and safety?"
			],
			"question_count": 16,
			"subTitle": "Aerospace Engineering"
		},
		{
			"duration_minutes": 70,
			"difficulty": "Hard",
			"declared_question_count": 15,
			"description": "",
			"questions": [
				"Describe the process of designing a new medical device, from needs assessment to regulatory submission.",
				"What is biocompatibility, and how would you test a new material for it?",
				"Explain the basic principles of an EKG (Electrocardiogram). What physiological process is it measuring?",
				"What are the key differences between designing a medical device for a hospital setting versus a home-use setting?",
				"What is the role of the FDA in medical device regulation? Describe the different classes of medical devices (Class I, II, III).",
				"You are tasked with designing a new artificial hip joint. What are the key design criteria, materials, and failure modes you would consider?",
				"Explain the principles of tissue engineering. What are the three main components of a tissue-engineered construct?",
				"What is a biosensor? Describe the components and give an example of one.",
				"How would you apply principles of fluid mechanics to analyze blood flow in an artery?",
				"What are some of the challenges in designing a drug delivery system?",
				"Explain the imaging principles behind MRI or CT scans.",
				"How does a pacemaker work?",
				"What are sterilization methods for medical devices, and how do you choose the appropriate one?",
				"Describe the importance of human factors engineering in medical device design.",
				"Tell me about a challenge in biomedical engineering you find particularly interesting and how you might approach solving it."
			],
			"question_count": 15,
			"subTitle": "Biomedical Engineering"
		},
		{
			"duration_minutes": 60,
			"difficulty": "Medium",
			"declared_question_count": 14,
			"description": "",
			"questions": [
				"What are the primary types of loads that a building structure must be designed to resist?",
				"Explain the difference between concrete and steel as structural materials. What are the advantages and disadvantages of each?",
				"What is the purpose of rebar in reinforced concrete?",
				"Describe the key stages of a major construction project, from planning to completion.",
				"What is a soil mechanics report, and why is it essential before starting construction?",
				"Explain the principles of stormwater management for a new land development project.",
				"What is the role of a geotechnical engineer on a construction project?",
				"How would you design a simple beam to support a given load? What calculations would you perform?",
				"What are some key considerations in transportation engineering when designing a new roadway intersection?",
				"What is the purpose of a project's critical path method (CPM) schedule?",
				"How do you ensure safety on a construction site?",
				"What is BIM (Building Information Modeling), and how is it changing the civil engineering industry?",
				"Tell me about a challenging problem you solved on a past civil engineering project.",
				"What environmental regulations do you need to consider when designing a new infrastructure project?"
			],
			"question_count": 14,
			"subTitle": "Civil Engineering"
		},
		{
			"duration_minutes": 55,
			"difficulty": "Medium",
			"declared_question_count": 13,
			"description": "",
			"questions": [
				"Explain Ohm's Law and Kirchhoff's Laws (both current and voltage laws).",
				"What is the difference between AC and DC electricity?",
				"What is a transistor, and how does it work as a switch?",
				"Describe the function of a capacitor and an inductor in a circuit.",
				"What is impedance, and how does it relate to resistance, capacitance, and inductance?",
				"Explain the difference between a microcontroller and a microprocessor.",
				"What is a digital filter, and how does it differ from an analog filter?",
				"Describe the basic principles of a transformer.",
				"You are given a 5V power supply and need to power a 3V LED. How would you design a simple circuit to do this safely?",
				"What is pulse-width modulation (PWM), and what is it used for?",
				"What is the purpose of an operational amplifier (op-amp)?",
				"How do you use an oscilloscope and a multimeter to troubleshoot a circuit?",
				"Tell me about a project where you designed, built, and tested an electrical circuit."
			],
			"question_count": 13,
			"subTitle": "Electrical Engineering"
		},
		{
			"duration_minutes": 60,
			"difficulty": "Medium",
			"declared_question_count": 14,
			"description": "",
			"questions": [
				"What are the three modes of heat transfer? Give an example of each.",
				"Explain the difference between stress and strain.",
				"What is the purpose of a factor of safety in mechanical design?",
				"Describe the first and second laws of thermodynamics.",
				"What are some common manufacturing processes (e.g., machining, casting, 3D printing), and when would you choose one over another?",
				"What is a Free Body Diagram, and why is it important in mechanical analysis?",
				"Explain the difference between a ductile and a brittle material.",
				"What is Finite Element Analysis (FEA), and what is it used for?",
				"You need to design a system to transmit power from a motor to a wheel. What are some options you would consider (e.g., gears, belts, chains)?",
				"What is the difference between a static and a dynamic analysis?",
				"How does a four-stroke internal combustion engine work?",
				"What is GD&T (Geometric Dimensioning and Tolerancing), and why is it important on engineering drawings?",
				"Tell me about a hands-on project you've worked on. What were the design challenges?",
				"How do you select the right material for a mechanical component?"
			],
			"question_count": 14,
			"subTitle": "Mechanical Engineering"
		},
		{
			"duration_minutes": 65,
			"difficulty": "Medium",
			"declared_question_count": 14,
			"description": "",
			"questions": [
				"What is the role of a software architect?",
				"Explain the trade-offs between a monolithic architecture and a microservices architecture.",
				"What are some common architectural patterns you have used (e.g., MVC, Layered, Event-Driven)?",
				"How do you design a system for high availability and fault tolerance?",
				"What are the \"ilities\" of software architecture (e.g., scalability, reliability, maintainability)? How do you prioritize them?",
				"Describe your process for making a significant technical decision, like choosing a new database or framework.",
				"What is the CAP theorem, and what are its implications for distributed system design?",
				"How do you approach API design for a large-scale system? Discuss REST vs. GraphQL.",
				"What is the purpose of a service discovery mechanism in a microservices architecture?",
				"How do you manage data consistency across multiple services?",
				"Tell me about a time you had to make a design trade-off between performance and cost.",
				"How do you ensure security is a fundamental part of your architecture, not an afterthought?",
				"What is technical debt, and what is the architect's role in managing it?",
				"How would you design a caching strategy for a high-traffic web application?"
			],
			"question_count": 14,
			"subTitle": "Software Architecture"
		}
	],
	"Marketing": [
		{
			"duration_minutes": 50,
			"difficulty": "Medium",
			"declared_question_count": 12,
			"description": "",
			"questions": [
				"What, in your view, is a brand? What's the difference between a brand and a product?",
				"How would you conduct a brand audit for an existing company?",
				"What is brand positioning? Walk me through how you would create a positioning statement.",
				"Who are the competitors for our brand? What are their key strengths and weaknesses?",
				"How do you measure brand equity and brand health?",
				"Tell me about a brand you admire. What makes their brand strategy so effective?",
				"You are tasked with launching a new product under an existing brand. How do you ensure the launch is consistent with the master brand's identity?",
				"What is the relationship between brand strategy and marketing tactics?",
				"How do you ensure brand consistency across all customer touchpoints?",
				"Describe a time you had to reposition a brand in the market. What was your strategy?",
				"What is the role of packaging and visual identity in brand management?",
				"How would you handle a situation that could potentially damage the brand's reputation?"
			],
			"question_count": 12,
			"subTitle": "Brand Management"
		},
		{
			"duration_minutes": 40,
			"difficulty": "Easy",
			"declared_question_count": 8,
			"description": "",
			"questions": [
				"What are the most important metrics to track in an email marketing campaign?",
				"How do you grow an email subscriber list?",
				"What is A/B testing in the context of email marketing? Give an example of something you would test.",
				"What are some best practices for writing an effective email subject line?",
				"What is the difference between a transactional email and a marketing email?",
				"How do you avoid your emails being marked as spam?",
				"What is list segmentation, and why is it important?",
				"Walk me through the process of creating a simple email welcome series for new subscribers."
			],
			"question_count": 8,
			"subTitle": "Email Marketing"
		},
		{
			"duration_minutes": 55,
			"difficulty": "Medium",
			"declared_question_count": 13,
			"description": "",
			"questions": [
				"What is the difference between growth marketing and traditional digital marketing?",
				"Describe the Pirate Metrics framework (AARRR).",
				"What is your process for designing and running growth experiments?",
				"How do you identify the \"aha!\" moment for a new user in a product?",
				"What are the key levers for improving user activation?",
				"Tell me about a successful growth experiment you've run. What was the hypothesis, what did you do, and what were the results?",
				"How do you balance acquiring new users with retaining existing ones?",
				"What role does product play in growth marketing?",
				"How do you decide which marketing channels to focus on for growth?",
				"What is a viral loop, and how would you try to build one into a product?",
				"How do you use data and analytics to find growth opportunities?",
				"Tell me about a time an experiment failed. What did you learn from it?",
				"What is your favorite growth hack or strategy that you've seen a company implement?"
			],
			"question_count": 13,
			"subTitle": "Growth Marketing"
		},
		{
			"duration_minutes": 45,
			"difficulty": "Medium",
			"declared_question_count": 12,
			"description": "",
			"questions": [
				"How do you identify the right influencers for a specific brand or campaign?",
				"What's the difference between micro-influencers and macro-influencers? When would you use each?",
				"How do you approach influencer outreach and build relationships?",
				"What are the key components of an effective influencer campaign brief?",
				"How do you measure the ROI of an influencer marketing campaign?",
				"What are some common ways to structure compensation for influencers?",
				"How do you ensure that influencer content is authentic and aligns with the brand's values?",
				"What are the FTC guidelines for influencer marketing, and how do you ensure compliance?",
				"Tell me about a challenge you faced during an influencer campaign and how you resolved it.",
				"How do you vet an influencer to ensure their audience is real and engaged?",
				"What is your process for negotiating contracts with influencers or their agents?",
				"What trends are you seeing in the influencer marketing space right now?"
			],
			"question_count": 12,
			"subTitle": "Influencer Marketing"
		},
		{
			"duration_minutes": 55,
			"difficulty": "Medium",
			"declared_question_count": 13,
			"description": "",
			"questions": [
				"What is performance marketing, and how does it differ from brand marketing?",
				"What are the key metrics you would use to evaluate the success of a paid search campaign? (e.g., CTR, CPC, CPA, ROAS).",
				"You are given a $50,000 monthly budget to acquire new customers for an e-commerce site. How would you allocate it across different channels?",
				"Explain what a Quality Score is in Google Ads and why it's important.",
				"How do you approach campaign optimization? Walk me through your daily or weekly process.",
				"What is conversion tracking, and why is it critical for performance marketing?",
				"Describe your experience with different bidding strategies (e.g., manual CPC, tCPA, tROAS).",
				"How do you use A/B testing to improve ad copy and landing page performance?",
				"Tell me about a time you managed a campaign that was underperforming. What steps did you take to turn it around?",
				"What is the difference between a search campaign and a display campaign?",
				"How do you approach keyword research for a new campaign?",
				"What is an attribution model, and why is it important?",
				"How do you combat click fraud in your campaigns?"
			],
			"question_count": 13,
			"subTitle": "Performance Marketing"
		},
		{
			"duration_minutes": 50,
			"difficulty": "Easy",
			"declared_question_count": 9,
			"description": "",
			"questions": [
				"What is the difference between SEO and SEM?",
				"What is a keyword? Explain the difference between short-tail and long-tail keywords.",
				"Walk me through the components of a search engine results page (SERP).",
				"What are the three main pillars of SEO? (On-page, Off-page, Technical).",
				"What is a meta description, and why is it important?",
				"What is a backlink, and why is it valuable for SEO?",
				"You are launching a new website. What are the first few SEO tasks you would perform?",
				"What are some tools you use for keyword research?",
				"Explain what Google Analytics is and what kind of information you can find there."
			],
			"question_count": 9,
			"subTitle": "Search Engine Marketing"
		}
	],
	"Product": [
		{
			"duration_minutes": 55,
			"difficulty": "Medium",
			"declared_question_count": 13,
			"description": "",
			"questions": [
				"What is the difference between a product analyst and a business intelligence analyst?",
				"A product manager wants to understand why user engagement has dropped by 10% in the last month. How would you investigate this?",
				"What is your process for defining key metrics for a new feature?",
				"Explain the concept of a product funnel. How would you use it to identify drop-off points?",
				"What is cohort analysis, and why is it useful for understanding user behavior?",
				"How do you design and analyze an A/B test to determine if a new feature is successful?",
				"What is statistical significance, and how would you explain it to a non-technical PM?",
				"Tell me about a time you used data to tell a story that influenced a product decision.",
				"What are your favorite product analytics tools (e.g., Mixpanel, Amplitude, Google Analytics), and what are their strengths and weaknesses?",
				"How do you differentiate between correlation and causation when analyzing data?",
				"What is a \"North Star Metric\"? How would you help a team define one?",
				"How do you handle incomplete or messy data in your analysis?",
				"A PM asks you to \"pull some data\" on a feature. What clarifying questions do you ask first?"
			],
			"question_count": 13,
			"subTitle": "Product Analytics"
		},
		{
			"duration_minutes": 60,
			"difficulty": "Medium",
			"declared_question_count": 14,
			"description": "",
			"questions": [
				"How do you define \"product growth\"? How does it differ from growth marketing?",
				"Describe the AARRR (Pirate Metrics) funnel. Pick one stage and describe how you would improve it.",
				"What is your framework for identifying and prioritizing growth opportunities?",
				"How do you identify the \"aha!\" moment for users of a product?",
				"Walk me through how you would design an experiment to improve new user activation.",
				"What is a growth model, and why is it useful?",
				"Tell me about a product you think has a brilliant growth loop. What is it?",
				"How do you balance short-term growth experiments with long-term product vision?",
				"How do you collaborate with product, marketing, and engineering teams as a growth PM?",
				"What is the role of user research in product growth?",
				"Describe a time a growth experiment you ran failed. What did you learn?",
				"How would you approach improving user retention for a subscription-based product?",
				"What is the difference between a leading and a lagging indicator for growth?",
				"How do you decide whether to focus on acquisition, activation, or retention for a product at its current stage?"
			],
			"question_count": 14,
			"subTitle": "Product Growth"
		},
		{
			"duration_minutes": 60,
			"difficulty": "Medium",
			"declared_question_count": 14,
			"description": "",
			"questions": [
				"What is the role of a Product Manager?",
				"How do you decide what to build next? Describe your prioritization process.",
				"Walk me through how you would take a new product idea from concept to launch.",
				"How do you work with engineers and designers?",
				"Tell me about a time you had to make a decision with incomplete data.",
				"How do you say \"no\" to a stakeholder or an executive who requests a feature?",
				"What is your favorite product, and why? How would you improve it?",
				"How do you define and measure success for a new feature?",
				"Describe a time a product launch didn't go as planned. What happened, and what did you learn?",
				"How do you gather and synthesize user feedback?",
				"What is the difference between product strategy and a product roadmap?",
				"How do you write an effective user story?",
				"Tell me about a time you had a disagreement with an engineer on your team. How did you resolve it?",
				"How do you stay up-to-date with industry trends and competitors?"
			],
			"question_count": 14,
			"subTitle": "Product Management"
		},
		{
			"duration_minutes": 45,
			"difficulty": "Easy",
			"declared_question_count": 9,
			"description": "",
			"questions": [
				"What is the role of a product marketing manager? How does it differ from a product manager?",
				"What are the key components of a go-to-market (GTM) strategy?",
				"How do you conduct competitor analysis?",
				"What is product positioning, and why is it important?",
				"Who is our target audience? How would you create a user persona for them?",
				"How do you translate technical product features into customer-centric benefits?",
				"What is the purpose of sales enablement materials? What are some examples?",
				"You are about to launch a new product. Walk me through the key marketing activities you would plan for launch day.",
				"Tell me about a product launch you thought was particularly effective. What did they do well?"
			],
			"question_count": 9,
			"subTitle": "Product Marketing"
		},
		{
			"duration_minutes": 50,
			"difficulty": "Medium",
			"declared_question_count": 12,
			"description": "",
			"questions": [
				"In your own words, what is the purpose of a Product Operations role?",
				"How do you help product teams become more efficient and effective?",
				"Describe your process for managing the product feedback loop, from collection to synthesis and reporting.",
				"What tools and systems would you implement to improve communication between product, engineering, and go-to-market teams?",
				"How do you help manage and communicate a product roadmap to the wider organization?",
				"Tell me about a time you improved a process for your product team. What was the problem, and what was the impact of your solution?",
				"How do you manage the beta testing process for a new feature release?",
				"What is your role in ensuring data quality and accessibility for the product team?",
				"How do you support the product team with tooling and software (e.g., Jira, Aha!, Productboard)?",
				"How do you help standardize product development processes, such as sprint planning or retrospectives, across multiple teams?",
				"A product manager is struggling with stakeholder management. How would you support them?",
				"How do you measure the success of the Product Operations function itself?"
			],
			"question_count": 12,
			"subTitle": "Product Operations"
		},
		{
			"duration_minutes": 50,
			"difficulty": "Easy",
			"declared_question_count": 9,
			"description": "",
			"questions": [
				"What is the difference between qualitative and quantitative user research?",
				"You are tasked with understanding if there is a market need for a new product idea. What research methods would you use?",
				"How do you recruit participants for a research study?",
				"Walk me through how you would conduct a user interview.",
				"What is a user persona, and how do you create one based on research?",
				"How do you create and run a user survey? What are some common pitfalls to avoid?",
				"What is a usability test?",
				"How do you synthesize your research findings and present them to the product team in an actionable way?",
				"Tell me about a time when a research finding surprised you or changed the direction of a product."
			],
			"question_count": 9,
			"subTitle": "Product Research"
		}
	],
	"Writing": [
		{
			"duration_minutes": 40,
			"difficulty": "Easy",
			"declared_question_count": 8,
			"description": "",
			"questions": [
				"What is content marketing, and how does it differ from traditional advertising?",
				"How do you come up with ideas for new content?",
				"What is a content calendar, and why is it useful?",
				"Walk me through your process for writing a blog post, from research to publishing.",
				"What is SEO, and how do you incorporate it into your writing?",
				"How do you tailor your writing style for different audiences and platforms?",
				"How would you measure the success of a piece of content?",
				"Tell me about a piece of content (an article, video, etc.) that you found particularly effective. Why did it work?"
			],
			"question_count": 8,
			"subTitle": "Content Marketing"
		},
		{
			"duration_minutes": 35,
			"difficulty": "Easy",
			"declared_question_count": 8,
			"description": "",
			"questions": [
				"What is the difference between copywriting and content writing?",
				"What is a Unique Selling Proposition (USP)?",
				"Walk me through your process for writing a headline.",
				"What is a call-to-action (CTA)? Write one for a free trial of a software product.",
				"How do you adopt a brand's specific voice and tone in your writing?",
				"What is A/B testing, and how would you use it to improve a piece of copy?",
				"Tell me about a piece of copy you wrote that you're proud of. What was the goal, and what were the results?",
				"Look at our website's homepage. What is one piece of copy you would improve, and how?"
			],
			"question_count": 8,
			"subTitle": "Copywriting"
		},
		{
			"duration_minutes": 40,
			"difficulty": "Easy",
			"declared_question_count": 8,
			"description": "",
			"questions": [
				"What genres do you most enjoy writing in, and why?",
				"Where do you find inspiration for your stories or poems?",
				"Describe your writing process. Are you a planner or do you discover the story as you go?",
				"What, in your opinion, makes a compelling character?",
				"How do you handle writer's block?",
				"Tell me about a writer whose work you admire. What do you like about their style?",
				"How do you receive and incorporate feedback on your creative work?",
				"Walk me through the basic structure of a story (e.g., beginning, rising action, climax, falling action, resolution)."
			],
			"question_count": 8,
			"subTitle": "Creative Writing"
		},
		{
			"duration_minutes": 50,
			"difficulty": "Medium",
			"declared_question_count": 12,
			"description": "",
			"questions": [
				"What are the key components of a typical grant proposal?",
				"How do you research and identify potential funding opportunities for a nonprofit organization?",
				"What is a logic model, and how do you use it in a grant proposal?",
				"How do you tailor a proposal to the specific interests and requirements of a particular foundation?",
				"Walk me through your process for writing a needs statement.",
				"How do you develop a realistic budget for a grant proposal?",
				"What is your strategy for building relationships with grant funders?",
				"Tell me about the most challenging grant proposal you've ever written. What made it difficult?",
				"How do you handle a rejection from a funder?",
				"What information is crucial to track when managing multiple grant deadlines and reporting requirements?",
				"How do you write a compelling project evaluation plan?",
				"What is the difference between a letter of inquiry (LOI) and a full proposal?"
			],
			"question_count": 12,
			"subTitle": "Grant Writing"
		},
		{
			"duration_minutes": 45,
			"difficulty": "Medium",
			"declared_question_count": 12,
			"description": "",
			"questions": [
				"What makes a story newsworthy?",
				"How do you find and develop sources for a story?",
				"What is the inverted pyramid style of writing? Why is it used in journalism?",
				"How do you prepare for an interview?",
				"What is the difference between on-the-record, off-the-record, and on-background information?",
				"How do you fact-check your stories and ensure accuracy?",
				"Tell me about a time you had to work on a tight deadline.",
				"What are the ethical principles you believe are most important for a journalist to follow?",
				"How do you handle a source who is reluctant to speak with you?",
				"What is your process for pitching a story idea to an editor?",
				"How has the rise of digital media and social media changed the field of journalism?",
				"Describe a story you've written that you are particularly proud of."
			],
			"question_count": 12,
			"subTitle": "Journalism"
		},
		{
			"duration_minutes": 45,
			"difficulty": "Easy",
			"declared_question_count": 9,
			"description": "",
			"questions": [
				"What is the primary goal of a technical writer?",
				"Who is the audience for technical documentation? How do you write for different types of users (e.g., novice vs. expert)?",
				"What is your process for learning about a complex product you need to document?",
				"What are the key components of a good user manual or knowledge base article?",
				"Explain the importance of using clear, concise language and avoiding jargon.",
				"How do you use screenshots and other visuals to support your writing?",
				"What experience do you have with documentation tools like Confluence, MadCap Flare, or Git?",
				"How do you work with subject matter experts (SMEs) like engineers to get the information you need?",
				"You find an error in a piece of existing documentation. What do you do?"
			],
			"question_count": 9,
			"subTitle": "Technical Writing"
		}
	],
	"Business": [
		{
			"duration_minutes": 60,
			"difficulty": "Hard",
			"declared_question_count": 15,
			"description": "",
			"questions": [
				"What is strategy? How does it differ from a plan or a tactic?",
				"Walk me through Porter's Five Forces framework. How would you apply it to the airline industry?",
				"What is a SWOT analysis? What are its limitations?",
				"Explain the concept of a competitive advantage. What are some sustainable sources of competitive advantage?",
				"Our company is considering entering a new market. What framework would you use to evaluate this opportunity?",
				"Describe the core competencies of a company you admire. How do they leverage them?",
				"What is the difference between a blue ocean and a red ocean strategy?",
				"How would you analyze the value chain of a business?",
				"Our main competitor just lowered its prices by 20%. How should we respond?",
				"What is a balanced scorecard, and how is it used in strategic planning?",
				"How do you translate a high-level business strategy into actionable initiatives?",
				"What are the risks of a growth-through-acquisition strategy?",
				"How do you measure the success of a strategic plan?",
				"Tell me about a time you were involved in developing a business strategy. What was your role?",
				"What major trends do you see disrupting our industry in the next 5-10 years?"
			],
			"question_count": 15,
			"subTitle": "Business Strategy"
		},
		{
			"duration_minutes": 45,
			"difficulty": "Medium",
			"declared_question_count": 12,
			"description": "",
			"questions": [
				"What is the primary goal of operations management?",
				"Explain the concept of a bottleneck in a process. How do you identify and address one?",
				"What is Lean manufacturing/management? What are some of its core principles?",
				"Describe the difference between quality control and quality assurance.",
				"What is inventory management? Explain a concept like Just-in-Time (JIT) or Economic Order Quantity (EOQ).",
				"How would you map out a business process to identify areas for improvement?",
				"What are Key Performance Indicators (KPIs) in an operational context? Give some examples.",
				"Tell me about a time you improved a process to make it more efficient.",
				"What is supply chain management, and what are its key components?",
				"How do you balance the trade-off between cost, quality, and speed in an operation?",
				"What is Six Sigma, and what is its goal?",
				"You notice that customer complaints about late deliveries have increased. How would you investigate the root cause?"
			],
			"question_count": 12,
			"subTitle": "Operations Management"
		},
		{
			"duration_minutes": 50,
			"difficulty": "Medium",
			"declared_question_count": 12,
			"description": "",
			"questions": [
				"What is your philosophy on sales leadership?",
				"How do you motivate a sales team? What's more important: individual incentives or team goals?",
				"Walk me through your process for creating a sales forecast.",
				"A top-performing salesperson is struggling this quarter. How do you coach them?",
				"How do you build and manage a sales pipeline?",
				"What are the key metrics you would use to manage the performance of a sales team?",
				"Describe your experience with different sales methodologies (e.g., MEDDIC, Challenger Sale, SPIN).",
				"How do you recruit, hire, and onboard new salespeople?",
				"Tell me about a time you had to let a salesperson go for underperformance. How did you handle it?",
				"How do you foster collaboration between the sales and marketing teams?",
				"What is your approach to sales training and development?",
				"You've just taken over a new sales team. What are the first things you would do in your first 90 days?"
			],
			"question_count": 12,
			"subTitle": "Sales Management"
		}
	],
	"Consulting": [
		{
			"duration_minutes": 60,
			"difficulty": "Hard",
			"declared_question_count": 15,
			"description": "",
			"questions": [
				"A client in the retail industry has seen declining profitability for the past three years. What framework would you use to diagnose the problem?",
				"Walk me through how you would build a financial model to evaluate a potential acquisition for a client.",
				"What is working capital management, and what are three strategies a company could use to improve it?",
				"A client wants to understand their company's valuation. What methods would you use, and what are the pros and cons of each?",
				"How would you advise a company on its capital structure (debt vs. equity)?",
				"A private equity firm is considering buying a company. What are the key areas of financial due diligence you would perform?",
				"What are the key drivers of enterprise value?",
				"A client is planning a major capital expenditure. How would you advise them to evaluate the project's financial viability (e.g., NPV, IRR, payback period)?",
				"How do you assess a company's risk profile?",
				"Tell me about a time you had to present complex financial analysis to a non-financial client.",
				"What are the financial implications of changing from a LIFO to a FIFO inventory accounting method?",
				"How would you help a client prepare a budget for the upcoming fiscal year?",
				"A client's cash flow is negative despite being profitable. What are the possible reasons?",
				"What are the current macroeconomic trends that are most impacting your clients?",
				"If I gave you the three financial statements for any company, what are the first 5-10 things you would look at?"
			],
			"question_count": 15,
			"subTitle": "Financial Consulting"
		},
		{
			"duration_minutes": 75,
			"difficulty": "Hard",
			"declared_question_count": 16,
			"description": "",
			"questions": [
				"A major airline is experiencing declining profits. What are the potential causes, and how would you investigate them? (Case Study)",
				"How would you advise the CEO of a luxury car brand that is considering entering the electric vehicle market? (Case Study)",
				"What are the key challenges facing the newspaper industry, and what strategies could a major newspaper adopt to survive? (Case Study)",
				"A private equity firm has asked you to perform due diligence on a potential acquisition target. What are the key areas you would look into?",
				"Tell me about a time you worked on a team to solve a complex problem. What was your role?",
				"Describe a time you persuaded a client or team member to adopt your point of view when they were initially resistant.",
				"How do you structure an ambiguous problem?",
				"What is the 80/20 rule, and how would you apply it in a business context?",
				"How do you build rapport with a new client?",
				"Tell me about a time you had to manage a difficult stakeholder.",
				"What is a \"mutually exclusive, collectively exhaustive\" (MECE) framework?",
				"Why consulting?",
				"What is a project you've worked on that you're particularly proud of, and why?"
			],
			"question_count": 13,
			"subTitle": "Management Consulting"
		},
		{
			"duration_minutes": 60,
			"difficulty": "Medium",
			"declared_question_count": 14,
			"description": "",
			"questions": [
				"A client with a large, on-premise data center is considering migrating to the cloud. What are the key benefits and risks you would advise them on?",
				"What is digital transformation? Give an example of a company that has done it well.",
				"A regional bank wants to improve its mobile banking app. What would your approach be to gather requirements and recommend a solution?",
				"Explain the concept of Agile methodology to a non-technical client.",
				"What is the role of data analytics in improving business performance?",
				"A client is concerned about cybersecurity. What are the top three recommendations you would give them to improve their security posture?",
				"How do you assess a client's existing technology stack to identify gaps and opportunities?",
				"What is CRM software, and how can it help a business?",
				"Tell me about a new technology trend (e.g., AI, IoT, blockchain) and how it could be applied to solve a business problem.",
				"How do you manage a technology implementation project to ensure it stays on time and on budget?",
				"A client has two different software systems that don't communicate with each other. What solutions would you propose?",
				"How do you bridge the gap between business stakeholders and a technical development team?",
				"Tell me about a time you had to explain a complex technical concept to a non-technical audience.",
				"How do you stay current with the latest technology trends?"
			],
			"question_count": 14,
			"subTitle": "Technology Consulting"
		}
	]
}